
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <!--
This HTML was auto-generated from MATLAB code.
To make changes, update the MATLAB code and republish this document.
      --><title>sldvmisscovtool&#27231;&#33021;&#35443;&#32048;</title><meta name="generator" content="MATLAB 7.13"><link rel="schema.DC" href="http://purl.org/dc/elements/1.1/"><meta name="DC.date" content="2011-12-28"><meta name="DC.source" content="sldvmisscovtool_doc_details.m"><style type="text/css">

body {
  background-color: white;
  margin:10px;
}

h1 {
  color: #990000; 
  font-size: x-large;
}

h2 {
  color: #990000;
  font-size: medium;
}

/* Make the text shrink to fit narrow windows, but not stretch too far in 
wide windows. */ 
p,h1,h2,div.content div {
  max-width: 600px;
  /* Hack for IE6 */
  width: auto !important; width: 600px;
}

pre.codeinput {
  background: #EEEEEE;
  padding: 10px;
}
@media print {
  pre.codeinput {word-wrap:break-word; width:100%;}
} 

span.keyword {color: #0000FF}
span.comment {color: #228B22}
span.string {color: #A020F0}
span.untermstring {color: #B20000}
span.syscmd {color: #B28C00}

pre.codeoutput {
  color: #666666;
  padding: 10px;
}

pre.error {
  color: red;
}

p.footer {
  text-align: right;
  font-size: xx-small;
  font-weight: lighter;
  font-style: italic;
  color: gray;
}

  </style></head><body><div class="content"><h1>sldvmisscovtool&#27231;&#33021;&#35443;&#32048;</h1><!--introduction--><!--/introduction--><h2>Contents</h2><div><ul><li><a href="#1">(1) GUI&#12398;&#20840;&#20307;&#27231;&#33021;&#27083;&#25104;</a></li><li><a href="#2">(2) &#12487;&#12540;&#12479;&#31649;&#29702;&#12506;&#12452;&#12531;</a></li><li><a href="#3">(2-1) &#12452;&#12531;&#12509;&#12540;&#12488;</a></li><li><a href="#4">(2-2) &#12456;&#12463;&#12473;&#12509;&#12540;&#12488;</a></li><li><a href="#5">(2-3) &#12503;&#12521;&#12464;&#12452;&#12531;&#12398;&#35443;&#32048;</a></li><li><a href="#6">(2-4) Signal Viewer&#12508;&#12479;&#12531;</a></li><li><a href="#7">(2-5) Signal Viewer GUI (sldvmisscovtool_signalviewer)</a></li><li><a href="#8">(3) &#23550;&#35937;&#12514;&#12487;&#12523;&#12506;&#12452;&#12531;</a></li><li><a href="#10">(4) &#12459;&#12496;&#12524;&#12483;&#12472;&#12506;&#12452;&#12531;</a></li><li><a href="#11">(5) SLDV&#12506;&#12452;&#12531;</a></li><li><a href="#12">(6) &#32080;&#26524;&#12398;&#12510;&#12540;&#12472;&#12506;&#12452;&#12531;</a></li></ul></div><h2>(1) GUI&#12398;&#20840;&#20307;&#27231;&#33021;&#27083;&#25104;<a name="1"></a></h2><p>&#26412;&#12484;&#12540;&#12523;&#12399;&#12289;&#27425;&#12398;6&#12388;&#12398;&#12506;&#12452;&#12531;&#12363;&#12425;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><div><ul><li><b>&#12487;&#12540;&#12479;&#31649;&#29702;</b> &#12487;&#12540;&#12479;&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#12391;&#19982;&#12360;&#12425;&#12428;&#12427;&#12487;&#12540;&#12479;&#12434;MATLAB WorkSpace&#19978;&#12395;&#35501;&#12415;&#36796;&#12415;&#12289;Simulink&#12398;&#20837;&#21147;&#12392;&#12375;&#12390;&#19982;&#12360;&#12425;&#12428;&#12427;&#24418;&#24335;&#12395;&#22793;&#25563;&#12377;&#12427;&#27231;&#33021;&#12434;&#25552;&#20379;&#12377;&#12427;&#12506;&#12452;&#12531;&#12391;&#12377;&#12290;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12487;&#12540;&#12479;&#12399;&#20219;&#24847;&#12398;&#24418;&#24335;&#12395;&#20986;&#21147;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;</li></ul></div><div><ul><li><b>&#23550;&#35937;&#12514;&#12487;&#12523;</b>     &#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12506;&#12452;&#12531;&#12395;&#12390;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#20837;&#21147;&#12392;&#12375;&#12390;&#19982;&#12360;&#12427;&#23550;&#35937;&#12514;&#12487;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12514;&#12487;&#12523;&#12398;&#20837;&#21147;&#12509;&#12540;&#12488;&#12398;&#24773;&#22577;&#12418;&#35501;&#12415;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>&#12459;&#12496;&#12524;&#12483;&#12472;</b>     &#12300;&#23550;&#35937;&#12514;&#12487;&#12523;&#12301;&#12391;&#36984;&#25246;&#12373;&#12428;&#12383;&#12514;&#12487;&#12523;&#12395;&#23550;&#12375;&#12289;&#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12391;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#19982;&#12360;&#12289;&#12514;&#12487;&#12523;&#12459;&#12496;&#12524;&#12483;&#12472;&#12434;&#28204;&#23450;&#12375;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>SLDV</b>     &#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#12301;&#12506;&#12452;&#12531;&#12391;&#28204;&#23450;&#12375;&#12383;&#12514;&#12487;&#12523;&#12459;&#12496;&#12524;&#12483;&#12472;&#12391;&#12289;100%&#12459;&#12496;&#12524;&#12483;&#12472;&#12364;&#36948;&#25104;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;Simulink Design Verifier&#12398;&#27231;&#33021;&#12434;&#29992;&#12356;&#12390;&#12289;&#26410;&#36948;&#25104;&#12398;&#12459;&#12496;&#12524;&#12483;&#12472;&#12395;&#21040;&#36948;&#12377;&#12427;&#12486;&#12473;&#12488;&#12505;&#12463;&#12479;&#12434;&#12371;&#12398;&#12506;&#12452;&#12531;&#12391;&#35299;&#26512;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>&#32080;&#26524;&#12398;&#12510;&#12540;&#12472;</b>     &#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12391;&#19982;&#12360;&#12425;&#12428;&#12383;&#12487;&#12540;&#12479;&#12392;&#12289;&#12300;SLDV&#12301;&#12506;&#12452;&#12531;&#12391;&#19982;&#12360;&#12425;&#12428;&#12383;&#12486;&#12473;&#12488;&#12505;&#12463;&#12479;&#12434;&#12510;&#12540;&#12472;&#12377;&#12427;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>&#24773;&#22577;</b>     &#25805;&#20316;&#12398;&#12498;&#12531;&#12488;&#12434;&#12371;&#12398;&#12506;&#12452;&#12531;&#12391;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</li></ul></div><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_01.PNG" alt=""> </p><h2>(2) &#12487;&#12540;&#12479;&#31649;&#29702;&#12506;&#12452;&#12531;<a name="2"></a></h2><h2>(2-1) &#12452;&#12531;&#12509;&#12540;&#12488;<a name="3"></a></h2><p>&#20219;&#24847;&#12398;&#12487;&#12540;&#12479;&#24418;&#24335;&#12434;MATLAB WorkSpace&#19978;&#12395;&#12289;Simulink&#12398;&#20837;&#21147;&#12392;&#12375;&#12390;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#24418;&#24335;&#12395;&#12452;&#12531;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;&#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12399;MATLAB&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#19978;&#12398;&#22793;&#25968; simdata &#12392;&#12375;&#12390;&#23450;&#32681;&#12373;&#12428;&#12414;&#12377;&#12290;&#12452;&#12531;&#12509;&#12540;&#12488;&#21487;&#33021;&#12394;&#12501;&#12449;&#12452;&#12523;&#12398;&#26360;&#24335;&#12399;&#12289;&#12518;&#12540;&#12470;&#12364;&#20219;&#24847;&#12395;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20316;&#25104;&#26041;&#27861;&#12399;&#12300;&#12503;&#12521;&#12464;&#12452;&#12531;&#12398;&#35443;&#32048;&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#26412;&#12484;&#12540;&#12523;&#12395;&#12399;&#12469;&#12531;&#12503;&#12523;&#12392;&#12375;&#12390;&#12289;&#27425;&#12398;&#20837;&#21147;&#24418;&#24335;&#12364;&#12354;&#12425;&#12363;&#12376;&#12417;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><p><b>CSV-&#12501;&#12449;&#12452;&#12523;(&#26178;&#38291;&#20849;&#36890;)</b></p><p>&#12377;&#12409;&#12390;&#12398;&#20449;&#21495;&#12395;&#20849;&#36890;&#12398;&#26178;&#38291;&#21015;&#12434;&#31532;&#19968;&#21015;&#12395;&#25345;&#12385;&#12289;&#12381;&#12398;&#26178;&#38291;&#36600;&#12395;&#23550;&#12375;&#12390;&#12289;&#20449;&#21495;&#12398;&#20516;&#12364;&#19982;&#12360;&#12425;&#12428;&#12427;CSV&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;</p><p>&#20363;&#65306;</p><pre>       Test Case 01
       time, SigA, SigB
       0.00,    0,    0
       0.10,   10,    0
       0.15,    5,    0
       0.25,    5,    1
       0.30,    7,    0
       0.40,    7,    0</pre><p>&#35500;&#26126;:</p><div><ul><li>1&#34892;&#30446;&#12395;&#12399;&#12289;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#21517;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#21517;&#12399;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#21517;&#21069;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</li><li>2&#34892;&#30446;&#12395;&#12399;&#12289;&#20449;&#21495;&#21517;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;&#31532;1&#21015;&#12399;&#26178;&#38291;&#12395;&#23550;&#24540;&#12375;&#12289;&#31532;2&#21015;&#12399;&#12452;&#12531;&#12509;&#12540;&#12488;&#12502;&#12525;&#12483;&#12463;&#12398;1&#30058;&#12509;&#12540;&#12488;&#12395;&#12289;&#31532;3&#21015;&#12399;&#12452;&#12531;&#12509;&#12540;&#12488;&#12502;&#12525;&#12483;&#12463;&#12398;&#31532;2&#12509;&#12540;&#12488;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;&#12514;&#12487;&#12523;&#19978;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12502;&#12525;&#12483;&#12463;&#12392;&#21516;&#21517;&#12395;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#38306;&#25968;&#12434;&#35352;&#36848;&#12377;&#12427;&#38555;&#12395;&#12399;&#12289;&#12371;&#12398;&#20449;&#21495;&#21517;&#24773;&#22577;&#12434;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;(&#20363;: Signal Builder&#12502;&#12525;&#12483;&#12463;&#12408;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12377;&#12427;&#38555;&#12395;&#12399;&#12289;Signal Builder&#12502;&#12525;&#12483;&#12463;&#20869;&#12398;&#20449;&#21495;&#21517;&#12392;&#12375;&#12390;&#19982;&#12360;&#12425;&#12428;&#12414;&#12377;)&#12290;</li><li>3&#34892;&#30446;&#20197;&#38477;&#12395;&#12399;&#12289;&#20449;&#21495;&#20516;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;</li><li><b>&#21046;&#32004;&#20107;&#38917;</b>&#65306; &#12371;&#12398;&#24418;&#24335;&#12391;CSV&#12501;&#12449;&#12452;&#12523;&#12434;&#35352;&#36848;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#27425;&#12398;&#21046;&#32004;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;     n&#34892;&#30446;&#12395;&#19982;&#12360;&#12425;&#12428;&#12383;&#26178;&#38291;&#12487;&#12540;&#12479;&#12434;|t(n)| &#12392;&#12375;&#12383;&#12392;&#12365;&#12289;|t(n+1) - t(n) &gt; 0| &#12364;&#24120;&#12395;&#25104;&#31435;&#12377;&#12427;&#12371;&#12392;&#12290;</li></ul></div><p><b>CSV-&#12501;&#12449;&#12452;&#12523;(&#26178;&#38291;&#21508;&#32068;)</b></p><p>&#21508;&#20449;&#21495;&#20516;&#12395;&#23550;&#12375;&#12390;&#12289;&#20491;&#21029;&#12398;&#26178;&#38291;&#36600;&#12487;&#12540;&#12479;&#12434;&#25345;&#12388;CSV&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;</p><p>&#20363;&#65306;</p><pre>       Test Case 02
       time, SigA, time, SigB
          0,    0,    0,    0
        0.1,   10, 0.25,    1
       0.15,    5,  0.3,    0
        0.3,    7,  0.4,    0
        0.4,    7,</pre><p>&#35500;&#26126;:</p><div><ul><li>1&#34892;&#30446;&#12395;&#12399;&#12289;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#21517;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#21517;&#12399;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#21517;&#21069;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</li><li>2&#34892;&#30446;&#12395;&#12399;&#12289;&#20449;&#21495;&#21517;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;&#31532;1&#21015;&#12399;&#26178;&#38291;&#12395;&#23550;&#24540;&#12375;&#12289;&#31532;2&#21015;&#12399;&#12452;&#12531;&#12509;&#12540;&#12488;&#12502;&#12525;&#12483;&#12463;&#12398;1&#30058;&#12509;&#12540;&#12488;&#12395;&#23550;&#24540;&#12377;&#12427;&#20449;&#21495;&#21517;&#12289;&#31532;3&#21015;&#12399;&#26178;&#38291;&#12289;&#31532;4&#21015;&#12399;&#12452;&#12531;&#12509;&#12540;&#12488;&#12502;&#12525;&#12483;&#12463;&#12398;&#31532;2&#12509;&#12540;&#12488;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;2n-1&#21015; (n=1,2,...) &#12399;&#26178;&#38291;&#12395;&#23550;&#24540;&#12375;&#12289; 2n&#21015;&#12399;&#12289;n&#30058;&#30446;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12502;&#12525;&#12483;&#12463;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;&#12514;&#12487;&#12523;&#19978;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12502;&#12525;&#12483;&#12463;&#12392;&#21516;&#21517;&#12395;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#38306;&#25968;&#12434;&#35352;&#36848;&#12377;&#12427;&#38555;&#12395;&#12399;&#12289;&#20449;&#21495;&#21517;&#24773;&#22577;&#12434;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</li><li>3&#34892;&#30446;&#20197;&#38477;&#12395;&#12399;&#12289;&#26178;&#38291;&#12392;&#20449;&#21495;&#20516;&#12398;&#32068;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#12382;&#12428;&#12398;&#20449;&#21495;&#12395;&#29420;&#31435;&#12398;&#26178;&#38291;&#24773;&#22577;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</li><li><b>&#21046;&#32004;&#20107;&#38917;</b>&#65306; &#12371;&#12398;&#24418;&#24335;&#12391;CSV&#12501;&#12449;&#12452;&#12523;&#12434;&#35352;&#36848;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#27425;&#12398;3&#28857;&#12398;&#21046;&#32004;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; n&#34892;&#30446;&#12395;&#19982;&#12360;&#12425;&#12428;&#12383;&#26178;&#38291;&#12487;&#12540;&#12479;&#12434; <tt>t(n)</tt> &#12392;&#12375;&#12383;&#12392;&#12365;&#12289; <tt>t(n+1) - t(n) &gt; 0</tt> &#12364;&#24120;&#12395;&#25104;&#31435;&#12377;&#12427;&#12371;&#12392;&#12290; &#12377;&#12409;&#12390;&#12398;&#20449;&#21495;&#12398;&#26368;&#32066;&#12398;&#26178;&#38291;(&#19978;&#35352;&#20363;&#12391;&#12399;0.4&#31186;)&#12434;&#20849;&#36890;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12377;&#12409;&#12390;&#12398;&#20449;&#21495;&#12399;&#12289;&#26368;&#32066;&#20449;&#21495;&#20516;&#12364;&#21069;&#22238;&#20516;&#12392;&#21516;&#19968;&#12398;&#20516;&#12434;&#25345;&#12388;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;(&#19978;&#35352;&#12398;&#20363;&#12391;&#12399;&#12289; SigA&#12399;&#20449;&#21495;&#20516;0.7&#12364;0.3&#31186;&#12289;0.4&#31186;&#12391;&#21516;&#19968;&#12290;SigB&#12399;&#20449;&#21495;&#20516;0&#12364;0.3&#31186;&#12289;0.4&#31186;&#12391;&#21516;&#19968;)&#12290;</li></ul></div><p><b>MAT-&#12501;&#12449;&#12452;&#12523;</b></p><p>&#25351;&#23450;&#12375;&#12383;MAT&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#20837;&#21147;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;MAT-&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;&#22793;&#25968;simdata&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12373;&#12425;&#12395;simdata&#12399;&#26178;&#38291;&#20184;&#12365;&#27083;&#36896;&#20307;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12371;&#12391;&#12289;&#26178;&#38291;&#20184;&#12365;&#27083;&#36896;&#20307;&#12395;&#38306;&#12377;&#12427;&#35443;&#32048;&#12394;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12289;&#27425;&#12434;&#12372;&#21442;&#29031;&#19979;&#12373;&#12356;&#12290;</p><div><ul><li><a href="matlab:web(['jar:file:///',docroot,'/ja_JP/toolbox/simulink/help.jar!/ug/f11-46877.html'],'-helpbrowser')">&#12504;&#12523;&#12503;-Simulink User Guide-&#12471;&#12511;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12398;&#23455;&#34892;-&#12471;&#12511;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12487;&#12540;&#12479;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12392;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;-&#20986;&#21147;&#12487;&#12540;&#12479;&#12434;MATLAB&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#12395;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;-&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12458;&#12503;&#12471;&#12519;&#12531;-&#26178;&#38291;&#20184;&#12365;&#27083;&#36896;&#20307;</a></li></ul></div><div><ul><li><a href="matlab:web(['jar:file:///',docroot,'/toolbox/simulink/help.jar!/ug/f11-46877.html'],'-helpbrowser')">Help-Simulink-Importing and Exporting Data-Exporting Data to the MATLAB Workspace - Format Options - Structure with time</a></li></ul></div><p><b>Signal Builder</b></p><p>&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;(gcb&#12467;&#12510;&#12531;&#12489;&#12398;&#32080;&#26524;&#12364;&#25351;&#12377;)&#12502;&#12525;&#12483;&#12463;&#12364;Signal Builder&#12502;&#12525;&#12483;&#12463;&#12398;&#22580;&#21512;&#12289;&#20840;&#12390;&#12398;&#12464;&#12523;&#12540;&#12503;&#12398;&#20449;&#21495;&#12487;&#12540;&#12479;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;</p><p><b>WorkSpace</b></p><p>&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#19978;&#12395;&#26178;&#38291;&#20184;&#12365;&#27083;&#36896;&#20307;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#22793;&#25968; simdata &#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;</p><p><b>sldvData</b></p><p>Simulink Design Verifier&#12395;&#12424;&#12387;&#12390;&#35299;&#26512;&#12373;&#12428;&#12383;&#32080;&#26524;&#12392;&#12375;&#12390;&#20316;&#25104;&#12373;&#12428;&#12427; sldvData &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#24418;&#24335;&#12398;MAT&#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_12.PNG" alt=""> </p><h2>(2-2) &#12456;&#12463;&#12473;&#12509;&#12540;&#12488;<a name="4"></a></h2><p>&#12452;&#12531;&#12509;&#12540;&#12488;&#27231;&#33021;&#12395;&#12424;&#12387;&#12390;&#20316;&#25104;&#12373;&#12428;&#12383;&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#22793;&#25968; simdata &#12434;&#20219;&#24847;&#12398;&#24418;&#24335;&#12395;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12398;&#26360;&#24335;&#12399;&#12289;&#12518;&#12540;&#12470;&#12364;&#20219;&#24847;&#12395;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20316;&#25104;&#26041;&#27861;&#12399;&#12300;&#12503;&#12521;&#12464;&#12452;&#12531;&#12398;&#35443;&#32048;&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#26412;&#12484;&#12540;&#12523;&#12395;&#12399;&#12469;&#12531;&#12503;&#12523;&#12392;&#12375;&#12390;&#12289;&#27425;&#12398;&#20837;&#21147;&#24418;&#24335;&#12364;&#12354;&#12425;&#12363;&#12376;&#12417;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_14.PNG" alt=""> </p><div><ul><li><b>CSV-&#12501;&#12449;&#12452;&#12523;(&#26178;&#38291;&#20849;&#36890;)</b> &#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#12289;&#12377;&#12409;&#12390;&#12398;&#20449;&#21495;&#12395;&#20849;&#36890;&#12398;&#26178;&#38291;&#21015;&#12434;&#31532;&#19968;&#21015;&#12395;&#25345;&#12385;&#12289;&#12381;&#12398;&#26178;&#38291;&#36600;&#12395;&#23550;&#12375;&#12390;&#12289;&#20449;&#21495;&#12398;&#20516;&#12364;&#19982;&#12360;&#12425;&#12428;&#12427;CSV&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>CSV-&#12501;&#12449;&#12452;&#12523;(&#26178;&#38291;&#21508;&#32068;)</b> &#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#12289;&#21508;&#20449;&#21495;&#20516;&#12395;&#23550;&#12375;&#12390;&#12289;&#20491;&#21029;&#12398;&#26178;&#38291;&#36600;&#12487;&#12540;&#12479;&#12434;&#25345;&#12388;CSV&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>MAT-&#12501;&#12449;&#12452;&#12523;</b> &#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#12289;MAT&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;MAT&#12501;&#12449;&#12452;&#12523;&#20869;&#12395;&#12399; simdata &#22793;&#25968;&#12364;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>Signal Builder</b>  &#26032;&#35215;&#12514;&#12487;&#12523;&#12434;&#20316;&#25104;&#12375;&#12289; &#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#12289;&#26032;&#12383;&#12395;&#20316;&#25104;&#12373;&#12428;&#12383;Signal Builder &#12502;&#12525;&#12483;&#12463;&#12395;&#26360;&#12365;&#20986;&#12375;&#12414;&#12377;&#12290;</li></ul></div><h2>(2-3) &#12503;&#12521;&#12464;&#12452;&#12531;&#12398;&#35443;&#32048;<a name="5"></a></h2><pre>   &#26412;&#12484;&#12540;&#12523;&#12391;&#12399;&#12289;&#12503;&#12521;&#12464;&#12452;&#12531;&#12392;&#12356;&#12358;&#20181;&#32068;&#12415;&#12395;&#12424;&#12426;&#12289;&#20219;&#24847;&#12398;&#12487;&#12540;&#12479;&#24418;&#24335;&#12434;&#35501;&#12415;&#36796;&#12435;&#12384;&#12426;&#12289;&#20219;&#24847;&#12398;&#12487;&#12540;&#12479;&#24418;&#24335;&#12395;&#26360;&#12365;&#20986;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</pre><p><b>(2-3-1) &#12503;&#12521;&#12464;&#12452;&#12531;&#12392;&#12375;&#12390;&#35469;&#35672;&#12373;&#12428;&#12427;&#26465;&#20214;</b></p><div><ul><li>sldvmisscovtool.m &#12392;&#21516;&#12376;&#12501;&#12457;&#12523;&#12480;&#12395;&#23384;&#22312;&#12377;&#12427;</li></ul></div><div><ul><li>&#12452;&#12531;&#12509;&#12540;&#12488;&#38306;&#25968;&#12398;&#22580;&#21512; import &#12363;&#12425;&#22987;&#12414;&#12427;&#38306;&#25968;M-&#12501;&#12449;&#12452;&#12523;&#12289;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#38306;&#25968;&#12398;&#22580;&#21512; export &#12363;&#12425;&#22987;&#12414;&#12427;M-&#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;</li></ul></div><pre>           &#20363;&#65306;&#12452;&#12531;&#12509;&#12540;&#12488;&#38306;&#25968;</pre><pre>           importCSVfile.m        importMATfile.m        importWorkSpace.m
           importCSVfile2.m       importSignalBuilder.m  importsldvDatafile.m</pre><pre>           &#20363;&#65306;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#38306;&#25968;</pre><pre>           exportCSVfile.m        exportMATfile.m
           exportCSVfile2.m       exportSignalBuilder.m</pre><p><b>(2-3-2) &#12503;&#12521;&#12464;&#12452;&#12531;&#38306;&#25968;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; : &#12452;&#12531;&#12509;&#12540;&#12488;&#38306;&#25968;</b></p><p>&#26412;&#12484;&#12540;&#12523;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12501;&#12457;&#12523;&#12480;&#20869;&#12395;&#21547;&#12414;&#12428;&#12427;  _importTemplate.m &#12395;&#35443;&#32048;&#12364;&#35352;&#36848;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><p><b>(2-3-3) &#12503;&#12521;&#12464;&#12452;&#12531;&#38306;&#25968;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488; : &#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#38306;&#25968;</b></p><p>&#26412;&#12484;&#12540;&#12523;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12501;&#12457;&#12523;&#12480;&#20869;&#12395;&#21547;&#12414;&#12428;&#12427;  _exportTemplate.m &#12395;&#35443;&#32048;&#12364;&#35352;&#36848;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><h2>(2-4) Signal Viewer&#12508;&#12479;&#12531;<a name="6"></a></h2><p>&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;Signal Viewer GUI (sldvmisscovtool_signalviewer)&#12364;&#21029;&#30011;&#38754;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12399;&#12289;&#20837;&#21147;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#65288;WorkSpace&#19978;&#12398;simdata&#22793;&#25968;&#65289;&#12434;&#21487;&#35222;&#21270;&#12377;&#12427;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</p><h2>(2-5) Signal Viewer GUI (sldvmisscovtool_signalviewer)<a name="7"></a></h2><p><img vspace="5" hspace="5" src="sldvmisscovtool_23.png" alt=""> </p><p><b>&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12362;&#12424;&#12403;&#12508;&#12479;&#12531;&#35500;&#26126;</b></p><div><ul><li><b>simdata &#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;</b> &#12371;&#12398;&#25551;&#30011;&#12484;&#12540;&#12523;&#12395;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;WorkSpace&#22793;&#25968;&#12395;&#21547;&#12414;&#12428;&#12427;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#19978;&#22259;&#12398;&#22580;&#21512;4&#12388;&#12398;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12364;&#35501;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>signals &#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;</b> simdata&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12391;&#36984;&#25246;&#12373;&#12428;&#12383;&#21508;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12395;&#21547;&#12414;&#12428;&#12427;&#20449;&#21495;&#12434;&#12377;&#12409;&#12390;&#34920;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;x-y&#12398;&#34920;&#35352;&#12399;&#12289;x&#30058;&#30446;&#12398;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12395;&#21547;&#12414;&#12428;&#12427;y&#30058;&#30446;&#12398;&#20449;&#21495;&#12391;&#12354;&#12426;&#12289; <i>simdata(x).signals(y)</i> &#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;&#65297;&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#34892;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#20449;&#21495;&#12434;Axes&#19978;&#12395;&#25551;&#30011;&#12375;&#12414;&#12377;&#12290;&#12484;&#12540;&#12523;&#12513;&#12491;&#12517;&#12540;&#12300;&#35373;&#23450;&#12301;-&#12300;&#21029;&#12293;&#12395;&#25551;&#30011;&#12301;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12395;&#12399;&#12289;&#30064;&#12394;&#12427;Axes&#12395;&#25551;&#30011;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;&#21516;&#35373;&#23450;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12395;&#12399;&#12289;1&#12388;&#12398;Axes&#12395;&#37325;&#12397;&#12390;&#25551;&#30011;&#12375;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>"Close"&#12508;&#12479;&#12531;</b> &#12371;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12434;&#38281;&#12376;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>"simdata&#12434;&#12525;&#12540;&#12489;"&#12508;&#12479;&#12531;</b> WorkSpace&#19978;&#12398;simdata&#22793;&#25968;&#12434;&#20877;&#35501;&#12415;&#36796;&#12415;&#12375;&#12414;&#12377;&#12290;</li></ul></div><div><ul><li><b>"figure&#12434;&#20316;&#25104;"&#12508;&#12479;&#12531;</b> &#29694;&#22312;&#25551;&#30011;&#12373;&#12428;&#12390;&#12356;&#12427;Axes&#12434;&#26032;&#12375;&#12356;figure&#12395;&#12467;&#12500;&#12540;&#12375;&#12289;&#20877;&#25551;&#30011;&#12375;&#12414;&#12377;&#12290;Plot Tool&#12394;&#12393;&#12434;&#29992;&#12356;&#12390;&#21152;&#24037;&#12539;&#20462;&#27491;&#12377;&#12427;&#22580;&#21512;&#12395;&#29992;&#12356;&#12414;&#12377;&#12290;</li></ul></div><p><b>&#35373;&#23450;&#12484;&#12540;&#12523;&#12513;&#12491;&#12517;&#12540;</b></p><p><img vspace="5" hspace="5" src="sldvmisscovtool_24.png" alt=""> </p><p><b>&#20961;&#20363;&#12434;&#34920;&#31034;</b></p><div><ul><li><b>&#26377;&#21177;</b>: &#12464;&#12521;&#12501;&#19978;&#12395;&#20961;&#20363;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12300;&#21029;&#12293;&#12395;&#25551;&#30011;&#12301;&#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#26377;&#21177;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;</li><li><b>&#28961;&#21177;</b>: &#12464;&#12521;&#12501;&#19978;&#12395;&#20961;&#20363;&#12434;&#34920;&#31034;&#12375;&#12414;&#12379;&#12435;&#12290;</li></ul></div><p><b>&#21029;&#12293;&#12395;&#25551;&#30011;</b></p><div><ul><li><b>&#26377;&#21177;</b>: 1&#12388;&#12398;Axes&#12395;1&#12388;&#12398;&#25551;&#30011;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;signals&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12391;10&#20197;&#19978;&#12398;&#20449;&#21495;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12399;&#33258;&#21205;&#30340;&#12395;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</li><li><b>&#28961;&#21177;</b>: &#36984;&#25246;&#12373;&#12428;&#12383;&#20449;&#21495;&#12434;1&#12388;&#12398;Axes&#12395;&#37325;&#12397;&#12390;&#25551;&#30011;&#12375;&#12414;&#12377;&#12290;</li></ul></div><p><b>&#35328;&#35486;</b></p><div><ul><li><b>&#26085;&#26412;&#35486;</b>: GUI&#12398;&#34920;&#35352;&#12434;&#26085;&#26412;&#35486;&#12395;&#12375;&#12414;&#12377;&#12290;</li><li><b>English</b> :GUI&#12398;&#34920;&#35352;&#12434;&#33521;&#35486;&#12395;&#12375;&#12414;&#12377;&#12290;</li></ul></div><h2>(3) &#23550;&#35937;&#12514;&#12487;&#12523;&#12506;&#12452;&#12531;<a name="8"></a></h2><p>&#12371;&#12398;&#12506;&#12452;&#12531;&#12391;&#12399;&#12289;&#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12506;&#12452;&#12531;&#12395;&#12390;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#20837;&#21147;&#12392;&#12375;&#12390;&#19982;&#12360;&#12427;&#23550;&#35937;&#12514;&#12487;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_04.PNG" alt=""> </p><p>&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12501;&#12449;&#12452;&#12523;&#36984;&#25246;&#30011;&#38754;&#12424;&#12426;&#12289;&#23550;&#35937;&#12392;&#12377;&#12427;&#12514;&#12487;&#12523;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#19968;&#26041;&#12391;&#12289;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_05.PNG" alt=""> </p><p>&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#12399;&#12289;bdroot&#12391;&#19982;&#12360;&#12425;&#12428;&#12427;&#12514;&#12487;&#12523;&#12364;&#23550;&#35937;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#36984;&#25246;&#24460;&#12395;&#12399;&#12289;&#12514;&#12487;&#12523;&#12364;&#38283;&#12363;&#12428;&#12289;&#20869;&#37096;&#30340;&#12395;&#12514;&#12487;&#12523;&#12398;&#12467;&#12531;&#12497;&#12452;&#12523;&#12467;&#12510;&#12531;&#12489;&#12364;&#30330;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</p><pre class="codeinput">modelname([],[],[],<span class="string">'compile'</span>)
</pre><p>&#12467;&#12531;&#12497;&#12452;&#12523;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#12514;&#12487;&#12523;&#12398;&#26368;&#19978;&#20301;&#38542;&#23652;&#12395;&#23384;&#22312;&#12377;&#12427;Inport&#12502;&#12525;&#12483;&#12463;&#12398;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12364;&#21028;&#26126;&#12375;&#12289;&#12300;&#20837;&#21147;&#12509;&#12540;&#12488;&#21517;&#12539;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12301;&#12522;&#12473;&#12488;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#35299;&#26512;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12399;&#12289;&#12300;&#12514;&#12487;&#12523;&#12398;&#20837;&#21147;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12395;&#36969;&#29992;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#22580;&#21512;&#12420;&#12289;&#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#12301;&#12506;&#12452;&#12531;&#12395;&#12362;&#12356;&#12390;&#12459;&#12496;&#12524;&#12483;&#12472;&#28204;&#23450;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#21069;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_16.PNG" alt=""> </p><p>&#12300;&#12514;&#12487;&#12523;&#12398;&#20837;&#21147;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12395;&#36969;&#29992;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12506;&#12452;&#12531;&#12391;&#35501;&#12415;&#36796;&#12414;&#12428;&#12289;&#12505;&#12540;&#12473;&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#12395;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#26178;&#38291;&#20184;&#12365;&#27083;&#36896;&#20307;&#22793;&#25968; simdata &#12398;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12434;&#12289;&#12514;&#12487;&#12523;&#12398;&#20837;&#21147;&#12509;&#12540;&#12488;&#12398;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12392;&#19968;&#33268;&#12377;&#12427;&#12424;&#12358;&#12395;&#12461;&#12515;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290;&#12394;&#12362;&#12289;&#12371;&#12398;&#12461;&#12515;&#12473;&#12488;&#12399;&#24517;&#12378;&#12375;&#12418;&#24517;&#35201;&#12391;&#12399;&#12394;&#12367;&#12289;&#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#12301;&#12506;&#12452;&#12531;&#12395;&#12362;&#12369;&#12427;&#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#28204;&#23450;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#38555;&#12395;&#12418;&#12289;&#12514;&#12487;&#12523;&#12398;&#20837;&#21147;&#12509;&#12540;&#12488;&#12398;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12392;&#30064;&#12394;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#12461;&#12515;&#12473;&#12488;&#12434;&#23455;&#26045;&#12377;&#12427;&#12363;&#12398;&#30906;&#35469;&#12364;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290;</p><h2>(4) &#12459;&#12496;&#12524;&#12483;&#12472;&#12506;&#12452;&#12531;<a name="10"></a></h2><p>&#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35336;&#28204;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12364;&#12289;&#12514;&#12487;&#12523;&#12398;&#20837;&#21147;&#12509;&#12540;&#12488;&#12398;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12392;&#19968;&#33268;&#12375;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12398;&#30906;&#35469;&#12364;&#12362;&#12371;&#12394;&#12431;&#12428;&#12414;&#12377;&#12290;&#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12364;&#19968;&#33268;&#12375;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#12289;&#12461;&#12515;&#12473;&#12488;&#12434;&#23455;&#26045;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12398;&#30906;&#35469;&#30011;&#38754;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_17.PNG" alt=""> </p><p>&#12371;&#12371;&#12391;&#12289;&#12300;&#12356;&#12356;&#12360;&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#12399;&#12289;&#25805;&#20316;&#12364;&#20013;&#27490;&#12373;&#12428;&#12289;&#20309;&#12418;&#34892;&#12431;&#12428;&#12414;&#12379;&#12435;&#12290;&#12300;&#12399;&#12356;&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#12399;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12395;&#23550;&#12377;&#12427;&#12471;&#12511;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12364;&#38918;&#27425;&#34892;&#12431;&#12428;&#12289;&#12459;&#12496;&#12524;&#12483;&#12472;&#28204;&#23450;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#36984;&#25246;&#12375;&#12383;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#12514;&#12487;&#12523;&#12398;&#20837;&#21147;&#12392;&#12375;&#12390;&#19982;&#12360;&#12383;&#22580;&#21512;&#12395;&#12289;&#12471;&#12511;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12391;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12398;&#36984;&#25246;&#12364;&#22806;&#12373;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#32047;&#31309;&#12459;&#12496;&#12524;&#12483;&#12472;&#12487;&#12540;&#12479;&#12399;&#12505;&#12540;&#12473;&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#19978;&#12395;&#12300;covData&#12301;&#12392;&#12375;&#12390;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290; &#8251; &#12300;&#12502;&#12525;&#12483;&#12463;&#12434;&#33394;&#20998;&#12369;&#12301;&#12395;&#12481;&#12455;&#12483;&#12463;&#12434;&#20837;&#12428;&#12390;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35336;&#28204;&#12434;&#34892;&#12356;&#12414;&#12377;&#12392;&#12289;&#12502;&#12525;&#12483;&#12463;&#33394;&#12395;&#12424;&#12426;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#21040;&#36948;&#29366;&#27841;&#12434;&#30906;&#35469;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_18.PNG" alt=""> </p><p>&#12300;&#12524;&#12509;&#12540;&#12488;&#12398;&#34920;&#31034;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#22580;&#21512;&#12395;&#12399;&#12289;&#32047;&#31309;&#12459;&#12496;&#12524;&#12483;&#12472;&#12487;&#12540;&#12479; covData &#12395;&#23550;&#12375;&#12390;&#12289;&#12459;&#12496;&#12524;&#12483;&#12472;&#28204;&#23450;&#12524;&#12509;&#12540;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><h2>(5) SLDV&#12506;&#12452;&#12531;<a name="11"></a></h2><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_19.PNG" alt=""> </p><p>&#12300;&#26410;&#36948;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35299;&#26512;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#12301;&#12506;&#12452;&#12531;&#12391;&#28204;&#23450;&#12375;&#12383;&#12514;&#12487;&#12523;&#12459;&#12496;&#12524;&#12483;&#12472;&#12391;100%&#12459;&#12496;&#12524;&#12483;&#12472;&#12364;&#36948;&#25104;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;Simulink Design Verifier&#12398;&#27231;&#33021;&#12434;&#29992;&#12356;&#12390;&#12289;&#26410;&#36948;&#25104;&#12398;&#12459;&#12496;&#12524;&#12483;&#12472;&#12395;&#21040;&#36948;&#12377;&#12427;&#12486;&#12473;&#12488;&#12505;&#12463;&#12479;&#12434;&#35299;&#26512;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12506;&#12452;&#12531;&#12399;&#12289;Simulink Design Verifier&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#25345;&#12387;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12398;&#33258;&#21205;&#29983;&#25104;&#27231;&#33021;&#12395;&#38306;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#35373;&#23450;&#12364;&#12481;&#12455;&#12483;&#12463;&#12508;&#12483;&#12463;&#12473;&#12391;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><h2>(6) &#32080;&#26524;&#12398;&#12510;&#12540;&#12472;&#12506;&#12452;&#12531;<a name="12"></a></h2><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_20.PNG" alt=""> </p><p>&#12300;&#32113;&#21512;&#12524;&#12509;&#12540;&#12488;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#35336;&#28204;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#38555;&#12395;&#12459;&#12496;&#12524;&#12483;&#12472;&#28204;&#23450;&#12364;&#34892;&#12431;&#12428;&#12383;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12391;&#28288;&#12383;&#12373;&#12428;&#12383;&#12459;&#12496;&#12524;&#12483;&#12472;&#23550;&#35937;&#12392;&#12289;&#12300;&#26410;&#36948;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35299;&#26512;&#12301;&#12391;&#27714;&#12417;&#12425;&#12428;&#12383;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12383;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12391;&#36948;&#25104;&#12373;&#12428;&#12383;&#12459;&#12496;&#12524;&#12483;&#12472;&#23550;&#35937;&#12395;&#23550;&#12375;&#12289;&#21512;&#31639;&#12364;&#12362;&#12371;&#12394;&#12431;&#12428;&#12383;&#12459;&#12496;&#12524;&#12483;&#12472;&#12524;&#12509;&#12540;&#12488;&#12434;&#29983;&#25104;&#12375;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_21.PNG" alt=""> </p><p>&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#12510;&#12540;&#12472;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289; &#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473; + &#12300;&#26410;&#36948;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35299;&#26512;&#12301;&#12395;&#12424;&#12387;&#12390;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12383;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473; &#12364;Signal Builder&#12395;&#21547;&#12414;&#12428;&#12427;&#12486;&#12473;&#12488;&#12495;&#12540;&#12493;&#12473;&#12514;&#12487;&#12523;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#12371;&#12398;&#12508;&#12479;&#12531;&#12395;&#12424;&#12387;&#12390;&#20316;&#25104;&#12373;&#12428;&#12383;Signal Builder&#12502;&#12525;&#12483;&#12463;&#12363;&#12425;&#12289;&#20877;&#12403;&#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12506;&#12452;&#12531;&#12395;&#12362;&#12369;&#12427;&#12300;Signal Builder&#12502;&#12525;&#12483;&#12463;&#12363;&#12425;&#12301;&#12452;&#12531;&#12509;&#12540;&#12488;&#12434;&#34892;&#12358;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#20877;&#12403;&#20837;&#21147;&#12392;&#12375;&#12390;&#25201;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p><p class="footer"><br>
      Published with MATLAB&reg; 7.13<br></p></div><!--
##### SOURCE BEGIN #####
%% sldvmisscovtool機能詳細
%
%% (1) GUIの全体機能構成
% 
% 本ツールは、次の6つのペインから構成されています。
%
% * *データ管理*
% データファイルなどで与えられるデータをMATLAB WorkSpace上に読み込み、Simulinkの入力として与えられる形式に変換する機能を提供するペインです。読み込まれたデータは任意の形式に出力することも可能です。
% 
% * *対象モデル*
%     「データ管理」ペインにて読み込まれたデータを入力として与える対象モデルを選択します。また、モデルの入力ポートの情報も読み込まれます。
% 
% * *カバレッジ*
%     「対象モデル」で選択されたモデルに対し、「データ管理」で読み込まれたデータを与え、モデルカバレッジを測定します。
% 
% * *SLDV*
%     「カバレッジ」ペインで測定したモデルカバレッジで、100%カバレッジが達成されない場合、Simulink Design Verifierの機能を用いて、未達成のカバレッジに到達するテストベクタをこのペインで解析することができます。
% 
% * *結果のマージ*
%     「データ管理」で与えられたデータと、「SLDV」ペインで与えられたテストベクタをマージする機能を提供します。
% 
% * *情報*
%     操作のヒントをこのペインで表示します。
% 
% <<SLDVMISSCOVTOOL_01.PNG>>

%% (2) データ管理ペイン
%
%% (2-1) インポート
% 
% 任意のデータ形式をMATLAB WorkSpace上に、Simulinkの入力として与えることができる形式にインポートします。インポートされたデータはMATLABワークスペース上の変数 simdata として定義されます。インポート可能なファイルの書式は、ユーザが任意に作成することができます。作成方法は「プラグインの詳細」を参照してください。本ツールにはサンプルとして、次の入力形式があらかじめ用意されています。
% 
% *CSV-ファイル(時間共通)*
% 
% すべての信号に共通の時間列を第一列に持ち、その時間軸に対して、信号の値が与えられるCSVファイルからデータを読み込みます。
% 
% 例：
% 
%         Test Case 01
%         time, SigA, SigB
%         0.00,    0,    0
%         0.10,   10,    0
%         0.15,    5,    0
%         0.25,    5,    1
%         0.30,    7,    0
%         0.40,    7,    0
% 
% 説明:
% 
% * 1行目には、テストケース名を記述します。このテストケース名は、「テストケース」リストボックスに表示される名前になります。
% * 2行目には、信号名を記述します。第1列は時間に対応し、第2列はインポートブロックの1番ポートに、第3列はインポートブロックの第2ポートに対応します。モデル上のインポートブロックと同名にする必要はありませんが、エクスポート関数を記述する際には、この信号名情報を利用することができます(例: Signal Builderブロックへエクスポートする際には、Signal Builderブロック内の信号名として与えられます)。
% * 3行目以降には、信号値を記述します。
% * *制約事項*： この形式でCSVファイルを記述する場合には、次の制約があります。
%     n行目に与えられた時間データを|t(n)| としたとき、|t(n+1) - t(n) > 0| が常に成立すること。
%
% *CSV-ファイル(時間各組)*
% 
% 各信号値に対して、個別の時間軸データを持つCSVファイルからデータを読み込みます。
% 
% 例：
% 
%         Test Case 02
%         time, SigA, time, SigB
%            0,    0,    0,    0
%          0.1,   10, 0.25,    1
%         0.15,    5,  0.3,    0
%          0.3,    7,  0.4,    0
%          0.4,    7,
% 
% 説明:
% 
% * 1行目には、テストケース名を記述します。このテストケース名は、「テストケース」リストボックスに表示される名前になります。
% * 2行目には、信号名を記述します。第1列は時間に対応し、第2列はインポートブロックの1番ポートに対応する信号名、第3列は時間、第4列はインポートブロックの第2ポートに対応します。つまり、2n-1列 (n=1,2,...) は時間に対応し、 2n列は、n番目のインポートブロックに対応します。モデル上のインポートブロックと同名にする必要はありませんが、エクスポート関数を記述する際には、信号名情報を利用することができます。
% * 3行目以降には、時間と信号値の組を記述します。それぞれの信号に独立の時間情報を与えることができます。
% * *制約事項*： この形式でCSVファイルを記述する場合には、次の3点の制約があります。
% n行目に与えられた時間データを
% |t(n)| 
% としたとき、
% |t(n+1) - t(n) > 0| 
% が常に成立すること。 
% すべての信号の最終の時間(上記例では0.4秒)を共通にしてください。 
% すべての信号は、最終信号値が前回値と同一の値を持つように指定してください(上記の例では、 SigAは信号値0.7が0.3秒、0.4秒で同一。SigBは信号値0が0.3秒、0.4秒で同一)。
% 
% *MAT-ファイル*
% 
% 指定したMATファイルから入力データを読み込みます。MAT-ファイルには、変数simdataが含まれていなければなりません。さらにsimdataは時間付き構造体フォーマットでなければなりません。ここで、時間付き構造体に関する詳細なドキュメントは、次をご参照下さい。
%
% * <matlab:web(['jar:file:///',docroot,'/ja_JP/toolbox/simulink/help.jar!/ug/f11-46877.html'],'-helpbrowser') ヘルプ-Simulink User Guide-シミュレーションの実行-シミュレーションデータのインポートとエクスポート-出力データをMATLABワークスペースにエクスポート-フォーマットオプション-時間付き構造体>
% 
% * <matlab:web(['jar:file:///',docroot,'/toolbox/simulink/help.jar!/ug/f11-46877.html'],'-helpbrowser') Help-Simulink-Importing and Exporting Data-Exporting Data to the MATLAB Workspace - Format Options - Structure with time>
% 
% *Signal Builder*
% 
% 選択されている(gcbコマンドの結果が指す)ブロックがSignal Builderブロックの場合、全てのグループの信号データをインポートします。
% 
% *WorkSpace*
% 
% ワークスペース上に時間付き構造体フォーマットで定義された変数 simdata を読み込みます。
% 
% *sldvData*
% 
% Simulink Design Verifierによって解析された結果として作成される sldvData フォーマット形式のMATファイルを読み込みます。
% 
% <<SLDVMISSCOVTOOL_12.PNG>>
%

%% (2-2) エクスポート
% 
% インポート機能によって作成されたワークスペース変数 simdata を任意の形式に出力します。出力ファイルの書式は、ユーザが任意に作成することができます。作成方法は「プラグインの詳細」を参照してください。本ツールにはサンプルとして、次の入力形式があらかじめ用意されています。
% 
% <<SLDVMISSCOVTOOL_14.PNG>>
% 
% * *CSV-ファイル(時間共通)*
% 選択されているテストケースを、すべての信号に共通の時間列を第一列に持ち、その時間軸に対して、信号の値が与えられるCSVファイルとして書き出します。
%
% * *CSV-ファイル(時間各組)*
% 選択されているテストケースを、各信号値に対して、個別の時間軸データを持つCSVファイルとして書き出します。
%
% * *MAT-ファイル*
% 選択されているテストケースを、MATファイルとして書き出します。MATファイル内には simdata 変数が保存されます。
%
% * *Signal Builder*
%  新規モデルを作成し、 選択されているテストケースを、新たに作成されたSignal Builder ブロックに書き出します。
% 

%% (2-3) プラグインの詳細
% 
%     本ツールでは、プラグインという仕組みにより、任意のデータ形式を読み込んだり、任意のデータ形式に書き出したりすることが可能です。
% 
% *(2-3-1) プラグインとして認識される条件*
% 
% * sldvmisscovtool.m と同じフォルダに存在する
%
% * インポート関数の場合 import から始まる関数M-ファイル、エクスポート関数の場合 export から始まるM-ファイルである
% 
%             例：インポート関数
% 
%             importCSVfile.m        importMATfile.m        importWorkSpace.m     
%             importCSVfile2.m       importSignalBuilder.m  importsldvDatafile.m
% 
%             例：エクスポート関数
% 
%             exportCSVfile.m        exportMATfile.m       
%             exportCSVfile2.m       exportSignalBuilder.m 
% 
% *(2-3-2) プラグイン関数フォーマット : インポート関数*
% 
% 本ツールインストールフォルダ内に含まれる  _importTemplate.m に詳細が記述されています。
% 
% *(2-3-3) プラグイン関数フォーマット : エクスポート関数*
% 
% 本ツールインストールフォルダ内に含まれる  _exportTemplate.m に詳細が記述されています。
% 
%% (2-4) Signal Viewerボタン
%
% をクリックすると、Signal Viewer GUI (sldvmisscovtool_signalviewer)が別画面で表示されます。このウィンドウは、入力テストケース（WorkSpace上のsimdata変数）を可視化する機能を提供します。
% 
%% (2-5) Signal Viewer GUI (sldvmisscovtool_signalviewer)
% 
% <<sldvmisscovtool_23.png>>
% 
% *リストボックスおよびボタン説明*
% 
% * *simdata リストボックス*
% この描画ツールに読み込まれたWorkSpace変数に含まれるテストケースを表します。上図の場合4つのテストケースが読み込まれています。
% 
% * *signals リストボックス*
% simdataリストボックスで選択された各テストケースに含まれる信号をすべて表示しています。x-yの表記は、x番目のテストケースに含まれるy番目の信号であり、
% _simdata(x).signals(y)_
% に対応します。１つまたは複数の行を選択すると、選択された信号をAxes上に描画します。ツールメニュー「設定」-「別々に描画」が有効な場合には、異なるAxesに描画を行います。同設定が無効な場合には、1つのAxesに重ねて描画します。
% 
% * *"Close"ボタン* 
% このウィンドウを閉じます。
% 
% * *"simdataをロード"ボタン*
% WorkSpace上のsimdata変数を再読み込みします。
% 
% * *"figureを作成"ボタン*
% 現在描画されているAxesを新しいfigureにコピーし、再描画します。Plot Toolなどを用いて加工・修正する場合に用います。
% 
% *設定ツールメニュー*
% 
% <<sldvmisscovtool_24.png>>
%
% *凡例を表示*
%
% * *有効*: グラフ上に凡例を表示します。「別々に描画」が無効である場合にのみ有効なオプションです。
% * *無効*: グラフ上に凡例を表示しません。
%  
% *別々に描画*
%
% * *有効*: 1つのAxesに1つの描画を行います。signalsリストボックスで10以上の信号が選択されている場合には自動的に無効になります。
% * *無効*: 選択された信号を1つのAxesに重ねて描画します。
% 
% *言語*
%
% * *日本語*: GUIの表記を日本語にします。
% * *English* :GUIの表記を英語にします。
% 
%% (3) 対象モデルペイン
% 
% このペインでは、「データ管理」ペインにて読み込まれたデータを入力として与える対象モデルを選択します。
% 
% <<SLDVMISSCOVTOOL_04.PNG>>
%
% をクリックすると、ファイル選択画面より、対象とするモデルファイルを選択します。一方で、
%
% <<SLDVMISSCOVTOOL_05.PNG>>
%
% を選択した場合には、bdrootで与えられるモデルが対象となります。選択後には、モデルが開かれ、内部的にモデルのコンパイルコマンドが発行されます。
% 

modelname([],[],[],'compile')

%% 
% コンパイルが実行されることにより、モデルの最上位階層に存在するInportブロックのデータタイプが判明し、「入力ポート名・データタイプ」リストに表示されます。解析されたデータタイプは、「モデルの入力データタイプに適用」ボタンをクリックした場合や、「カバレッジ」ペインにおいてカバレッジ測定が実行される前に使用されます。
% 
% <<SLDVMISSCOVTOOL_16.PNG>>
%
% 「モデルの入力データタイプに適用」をクリックすると、「データ管理」ペインで読み込まれ、ベースワークスペースに定義されている時間付き構造体変数 simdata のデータタイプを、モデルの入力ポートのデータタイプと一致するようにキャストします。なお、このキャストは必ずしも必要ではなく、「カバレッジ」ペインにおける「カバレッジ測定」ボタンをクリックした際にも、モデルの入力ポートのデータタイプと異なる場合には、キャストを実施するかの確認がなされます。
%
%% (4) カバレッジペイン
% 「カバレッジの計測」ボタンをクリックすると、「テストケース」リストボックスで選択されているすべてのデータが、モデルの入力ポートのデータタイプと一致しているかどうかの確認がおこなわれます。データタイプが一致しない場合には、キャストを実施するかどうかの確認画面が表示されます。
% 
% <<SLDVMISSCOVTOOL_17.PNG>>
% 
% ここで、「いいえ」を選択した場合には、操作が中止され、何も行われません。「はい」を選択した場合には、「テストケース」リストボックスで選択されているすべてのデータに対するシミュレーションが順次行われ、カバレッジ測定が行われます。選択したテストケースをモデルの入力として与えた場合に、シミュレーションでエラーが発生する場合には、「テストケース」リストボックスの選択が外されます。また、累積カバレッジデータはベースワークスペース上に「covData」として保存されます。
% ※ 「ブロックを色分け」にチェックを入れてカバレッジの計測を行いますと、ブロック色によりカバレッジの到達状況を確認できます。
% 
% <<SLDVMISSCOVTOOL_18.PNG>>
%
% 「レポートの表示」ボタンをクリックした場合には、累積カバレッジデータ covData に対して、カバレッジ測定レポートが表示されます。

%% (5) SLDVペイン
% 
% <<SLDVMISSCOVTOOL_19.PNG>>
%
% 「未達カバレッジの解析」ボタンをクリックすると、「カバレッジ」ペインで測定したモデルカバレッジで100%カバレッジが達成されない場合、Simulink Design Verifierの機能を用いて、未達成のカバレッジに到達するテストベクタを解析することができます。
% このペインは、Simulink Design Verifierのライセンスを持っていない場合には表示されません。
% テストケースの自動生成機能に関するオプション設定がチェックボックスで用意されています。
%
%% (6) 結果のマージペイン
% 
% <<SLDVMISSCOVTOOL_20.PNG>>
%
% 「統合レポート」ボタンをクリックすると、「カバレッジ計測」ボタンをクリックした際にカバレッジ測定が行われた、「テストケース」で選択されているテストケースで満たされたカバレッジ対象と、「未達カバレッジの解析」で求められた自動生成されたテストケースで達成されたカバレッジ対象に対し、合算がおこなわれたカバレッジレポートを生成します。
% 
% <<SLDVMISSCOVTOOL_21.PNG>>
%
% 「テストケースをマージ」をクリックすると、 
% 「テストケース」リストボックスで選択されているテストケース + 「未達カバレッジの解析」によって自動生成されたテストケース 
% がSignal Builderに含まれるテストハーネスモデルが作成されます。
% 
% このボタンによって作成されたSignal Builderブロックから、再び「データ管理」ペインにおける「Signal Builderブロックから」インポートを行うことにより、テストケースを再び入力として扱うことができるようになります。
% 

##### SOURCE END #####
--></body></html>