
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <!--
This HTML was auto-generated from MATLAB code.
To make changes, update the MATLAB code and republish this document.
      --><title>sldvmisscovtool &#23455;&#34892;&#20363;</title><meta name="generator" content="MATLAB 7.13"><link rel="schema.DC" href="http://purl.org/dc/elements/1.1/"><meta name="DC.date" content="2011-12-28"><meta name="DC.source" content="sldvmisscovtool_doc_gettingstarted.m"><style type="text/css">

body {
  background-color: white;
  margin:10px;
}

h1 {
  color: #990000; 
  font-size: x-large;
}

h2 {
  color: #990000;
  font-size: medium;
}

/* Make the text shrink to fit narrow windows, but not stretch too far in 
wide windows. */ 
p,h1,h2,div.content div {
  max-width: 600px;
  /* Hack for IE6 */
  width: auto !important; width: 600px;
}

pre.codeinput {
  background: #EEEEEE;
  padding: 10px;
}
@media print {
  pre.codeinput {word-wrap:break-word; width:100%;}
} 

span.keyword {color: #0000FF}
span.comment {color: #228B22}
span.string {color: #A020F0}
span.untermstring {color: #B20000}
span.syscmd {color: #B28C00}

pre.codeoutput {
  color: #666666;
  padding: 10px;
}

pre.error {
  color: red;
}

p.footer {
  text-align: right;
  font-size: xx-small;
  font-weight: lighter;
  font-style: italic;
  color: gray;
}

  </style></head><body><div class="content"><h1>sldvmisscovtool &#23455;&#34892;&#20363;</h1><p>(1) sldvmisscovtool&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p><pre class="codeinput">sldvmisscovtool
</pre><p>(2) &#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12497;&#12493;&#12523; &gt; &#12300;&#12452;&#12531;&#12509;&#12540;&#12488;&#12301;&#12424;&#12426;&#12487;&#12540;&#12479;&#35501;&#12415;&#36796;&#12415;&#25163;&#27861;&#12434;&#36984;&#25246;&#12375;&#12289;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_03.PNG" alt=""> </p><p>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290; &#8251;&#35501;&#12415;&#36796;&#12415;&#25163;&#27861;&#12399;&#12503;&#12521;&#12464;&#12452;&#12531;&#24418;&#24335;&#12395;&#12394;&#12387;&#12390;&#12362;&#12426;&#12289;&#36984;&#25246;&#12375;&#12383;&#25163;&#27861;&#12395;&#12424;&#12426;&#35501;&#12415;&#36796;&#12415;&#26041;&#27861;&#12364;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290; &#12371;&#12371;&#12391;&#12399;&#12289;&#12469;&#12531;&#12503;&#12523;&#12392;&#12375;&#12390;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12300;CSV-file(&#26178;&#38291;&#20849;&#36890;)&#12363;&#12425;&#12301;&#12364;&#36984;&#25246;&#12373;&#12428;&#12289;&#12501;&#12457;&#12523;&#12480;&#12300;cruise_control_data&#12301;&#20869;&#12398;&#12469;&#12531;&#12503;&#12523; csv&#12501;&#12449;&#12452;&#12523;&#12364;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12418;&#12398;&#12392;&#20206;&#23450;&#12375;&#12414;&#12377;&#12290;:</p><p><img vspace="5" hspace="5" src="sldvmisscovtool_06.png" alt=""> </p><p>(3) &#12300;Signl Viewer&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#19978;&#12391;&#36984;&#25246;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#12464;&#12521;&#12501;&#12395;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p><p>(4) &#12300;&#23550;&#35937;&#12514;&#12487;&#12523;&#12301;&#12506;&#12452;&#12531;&#12395;&#12390;&#12289;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_04.PNG" alt=""> </p><p>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#23550;&#35937;&#12392;&#12394;&#12427;&#12514;&#12487;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_05.PNG" alt=""> </p><p>&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#12399;&#12289;bdroot&#12391;&#19982;&#12360;&#12425;&#12428;&#12427;&#12514;&#12487;&#12523;&#12364;&#23550;&#35937;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#12399;&#12289;&#26412;&#12487;&#12514;&#12395;&#20184;&#23646;&#12398;&#12469;&#12531;&#12503;&#12523;&#12514;&#12487;&#12523;&#12300;sldvmiscovtool_sample.mdl&#12301;&#12364;&#36984;&#25246;&#12373;&#12428;&#12383;&#12418;&#12398;&#12392;&#20206;&#23450;&#12375;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_07.PNG" alt=""> </p><p>(5) &#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#12301;&#12497;&#12493;&#12523;&#12395;&#12390;&#12300;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35336;&#28204;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12487;&#12540;&#12479;&#12395;&#23550;&#12377;&#12427;&#12471;&#12511;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12364;&#38918;&#27425;&#34892;&#12431;&#12428;&#12289;&#32047;&#31309;&#12459;&#12496;&#12524;&#12483;&#12472;&#12487;&#12540;&#12479;&#12364;&#12505;&#12540;&#12473;&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#19978;&#12395;&#12300;covData&#12301;&#12392;&#12375;&#12390;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#8251; &#12300;&#12502;&#12525;&#12483;&#12463;&#12434;&#33394;&#20998;&#12369;&#12301;&#12395;&#12481;&#12455;&#12483;&#12463;&#12434;&#20837;&#12428;&#12390;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35336;&#28204;&#12434;&#34892;&#12356;&#12414;&#12377;&#12392;&#12289;&#12502;&#12525;&#12483;&#12463;&#33394;&#12395;&#12424;&#12426;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#21040;&#36948;&#29366;&#27841;&#12434;&#30906;&#35469;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_08.PNG" alt=""> </p><p>(6) &#12300;&#12524;&#12509;&#12540;&#12488;&#12398;&#34920;&#31034;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#19978;&#36848;&#12300;covData&#12301;&#12424;&#12426;&#12459;&#12496;&#12524;&#12483;&#12472;&#12524;&#12509;&#12540;&#12488;&#12364;&#29983;&#25104;&#12373;&#12428;&#12289;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;CSV&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#26410;&#36948;&#12459;&#12496;&#12524;&#12483;&#12472;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12364;&#30906;&#35469;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p>(7) &#12300;SLDV&#12301;&#12497;&#12493;&#12523;&#12395;&#12390;&#12300;&#26410;&#36948;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35299;&#26512;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#12289;&#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12301;&#12522;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12487;&#12540;&#12479;&#12395;&#23550;&#12377;&#12427;&#12471;&#12511;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12391;&#26410;&#36948;&#25104;&#12391;&#12354;&#12387;&#12383;&#12459;&#12496;&#12524;&#12483;&#12472;&#23550;&#35937;&#12395;&#21040;&#36948;&#12377;&#12427;&#12486;&#12473;&#12488;&#12505;&#12463;&#12479;&#12434;&#33258;&#21205;&#29983;&#25104;&#12375;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_09.PNG" alt=""> </p><p>(8) &#12300;&#32080;&#26524;&#12398;&#12510;&#12540;&#12472;&#12301;&#12497;&#12493;&#12523;&#12395;&#12390;&#12300;&#32113;&#21512;&#12524;&#12509;&#12540;&#12488;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12391;&#19982;&#12360;&#12425;&#12428;&#12383;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12392;&#12300;&#26410;&#36948;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35299;&#26512;&#12301;&#12395;&#12424;&#12387;&#12390;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12383;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#32113;&#21512;&#12375;&#12383;&#12459;&#12496;&#12524;&#12483;&#12472;&#12524;&#12509;&#12540;&#12488;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_10.PNG" alt=""> </p><p><img vspace="5" hspace="5" src="SLDVMISSCOVTOOL_11.PNG" alt=""> </p><p>(9) &#12300;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#12510;&#12540;&#12472;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12392;&#12289;&#12300;&#12487;&#12540;&#12479;&#31649;&#29702;&#12301;&#12391;&#19982;&#12360;&#12425;&#12428;&#12383;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12392;&#12289;&#12300;&#26410;&#36948;&#12459;&#12496;&#12524;&#12483;&#12472;&#12398;&#35299;&#26512;&#12301;&#12395;&#12424;&#12387;&#12390;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12383;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#12510;&#12540;&#12472;&#12375;&#12289;&#26032;&#12383;&#12394;&#12495;&#12540;&#12493;&#12473;&#12514;&#12487;&#12523;&#19978;&#12398;Signal Builder&#12502;&#12525;&#12483;&#12463;&#12395;&#12486;&#12473;&#12488;&#12465;&#12540;&#12473;&#12434;&#32113;&#21512;&#12375;&#12414;&#12377;&#12290;</p><p class="footer"><br>
      Published with MATLAB&reg; 7.13<br></p></div><!--
##### SOURCE BEGIN #####
%% sldvmisscovtool 実行例
% 
% 
% (1) sldvmisscovtoolを実行します。
% 
sldvmisscovtool

%%
% (2) 「データ管理」パネル > 「インポート」よりデータ読み込み手法を選択し、
%
% <<SLDVMISSCOVTOOL_03.PNG>>
%
% をクリックします。
% ※読み込み手法はプラグイン形式になっており、選択した手法により読み込み方法が異なります。
% ここでは、サンプルとして提供している「CSV-file(時間共通)から」が選択され、フォルダ「cruise_control_data」内のサンプル
% csvファイルが読み込まれたものと仮定します。:
% 
% <<sldvmisscovtool_06.png>>
% 
%
% (3) 「Signl Viewer」ボタンをクリックすることにより、「テストケース」リストボックス上で選択されたデータをグラフに表示します。
%
% (4) 「対象モデル」ペインにて、
%
% <<SLDVMISSCOVTOOL_04.PNG>>
%
% をクリックし、対象となるモデルを選択します。
%
% <<SLDVMISSCOVTOOL_05.PNG>> 
%
% を選択した場合には、bdrootで与えられるモデルが対象となります。ここでは、本デモに付属のサンプルモデル「sldvmiscovtool_sample.mdl」が選択されたものと仮定します。
% 
% <<SLDVMISSCOVTOOL_07.PNG>>
% 
% (5) 「カバレッジ」パネルにて「カバレッジの計測」ボタンをクリックすることにより、「テストケース」リストボックスで選択されているデータに対するシミュレーションが順次行われ、累積カバレッジデータがベースワークスペース上に「covData」として保存されます。
%
% ※ 「ブロックを色分け」にチェックを入れてカバレッジの計測を行いますと、ブロック色によりカバレッジの到達状況を確認できます。
% 
% <<SLDVMISSCOVTOOL_08.PNG>>
% 
% (6) 「レポートの表示」ボタンをクリックすると、上述「covData」よりカバレッジレポートが生成され、表示されます。CSVファイルには未達カバレッジが存在することが確認できます。     
% 
% (7) 「SLDV」パネルにて「未達カバレッジの解析」ボタンをクリックすることにより、、「テストケース」リストボックスで選択されているデータに対するシミュレーションで未達成であったカバレッジ対象に到達するテストベクタを自動生成します。
% 
% <<SLDVMISSCOVTOOL_09.PNG>>
% 
% (8) 「結果のマージ」パネルにて「統合レポート」をクリックすると、「データ管理」で与えられたテストケースと「未達カバレッジの解析」によって自動生成されたテストケースを統合したカバレッジレポートが生成されます。
% 
% <<SLDVMISSCOVTOOL_10.PNG>>
% 
% <<SLDVMISSCOVTOOL_11.PNG>>
% 
% (9) 「テストケースをマージ」をクリックしますと、「データ管理」で与えられたテストケースと、「未達カバレッジの解析」によって自動生成されたテストケースをマージし、新たなハーネスモデル上のSignal Builderブロックにテストケースを統合します。

##### SOURCE END #####
--></body></html>